Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/disability_and_illness/medical_care_scheme.html.txt.tmx
Source language: en
Languages: ga

source: If you are insured and you are injured at work, on an unbroken journey to/from work or you contract a prescribed occupational disease you may get benefits under the Occupational Injuries Scheme
ga: Má tá tú faoi árachas agus má ghortaítear thú agus tú ag obair nó má tholgann tú galar ceirde forordaithe, d'fhéadfá sochair a fháil faoin Scéim um Dhíobhálacha Ceirde

source: One of these benefits is Medical Care
ga: Ceann de na sochair atá i gceist ná Cúram Leighis

source: The Medical Care Scheme allows you to get a refund of the costs of medical care and attention that are not paid by the Health Service Executive (HSE) or covered by the Treatment Benefit Scheme
ga: Faoin scéim Cúram Leighis is féidir leat aisíoc a fháil ar chostais cúraim agus aire leighis nach mbíonn íoctha ag an láithreáin ghréasáin Limistéir Fheidhmeannacht na Seirbhíse Sláinte nó tríd an Sochar Cóir Leighis ón Roinn Coimirce Sóisialaí

source: The following expenses may be refunded if they are not fully met by the HSE or the Department of Social Protection's Treatment Benefit Scheme:
ga: Déanfar aisíoc ar na costaisí seo a leanas muna mbíonn siad clúdaithe go hiomlán ag an Limistéir Fheidhmeannacht na Seirbhíse Sláinte ná ag Scéim Sochar Chóir Leighis na Roinne Choimirce Sóisialaí:

source: • Certain medical or surgical appliances and the repair and replacement of these (for example, artificial limbs or hearing aids)
ga: • Fearais leighis agus máinliachta áirithe chomh maith le deisiú agus athsholáthar na deiseanna seo (mar shampla, géaga saorga nó cluaisíní chúnta)

source: • Certain dental and optical treatment
ga: • Cóir leighis fiaclóra agus optach áirithe

source: • Certain treatment prescribed by your doctor excluding treatment available under the Health Acts (for example, physiotherapy, scans (MRI) and consultant consultations)
ga: • Cóir leighis áirithe ar threoir dhochtúra

source: • Certain travelling expenses, usually limited to the cost of public transport
ga: • Costaisí taistil áirithe, go hiondúil ar chostas chóras iompar poiblí amháin

source: The expenses must be reasonable and necessary
ga: Is le EFT a íoctar an Cúram Leighis

source: Medical Care is paid by Electronic Fund Transfer (EFT). Normally, only one payment is made but if the treatment is ongoing, payment may be made in a few instalments
ga: Go hiondúil ní dhéantar ach íocaíocht amháin ach más cóir leighis leanúnach atá i gceist, b'fhéidir go ndéanfaí íocaíocht i gcúpla gála

source: Payment is usually made to the person who claims, but may be made to the HSE
ga: Is leis an duine a dhéanann an éileamh a dhéantar an íocaíocht go hiondúil ach is féidir é a dhéanamh le do dhochtúir nó an bord sláinte más gá

source: To qualify for a refund of medical costs you must satisfy the following conditions:
ga: Chun a bheith i dteideal aisíoca chostaisí leighis ní mór duit na coinníollacha seo a leanas a chomhlíonadh:

source: • Your injury must have been caused by an accident at work or as a result of your work you must have contracted a prescribed occupational disease and
ga: • Caithfidh an timpiste a bhí agat a bheith mar thoradh ar thimpiste ag an obair nó caithfidh tú galar áirithe ceirde a bheith ort mar thoradh ar do chuid oibre agus

source: • You must notify the Department of your intention to claim medical care within 6 weeks of the start of medical treatment
ga: • Caithfidh tú an Roinn a chur ar an eolas faoi go bhfuil tú chun cúram leighis a éileamh taobh istigh de 6 seachtainí ó thús an chóir leighis

source: This is normally 6 weeks from the date of the accident or the development of the disease and you must be in employment insurable at PRSI class A, B, D, J or M
ga: Go hiondúil ciallaíonn sé seo sé seachtainí ó dháta na timpiste nó ó thús an ghalair. Freisin ní mór duit a bheith i bhfostaíocht a bhfuil i rannóg A, B, D, J nó M i gcomhair ÁSPC

source: All work accidents or occupational diseases may not result immediately in illness or disablement
ga: Ní tharlaíonn tinneas ná míchumas láithreach mar thoradh ar gach timpiste san obair nó galar ceirde

source: If you are not immediately incapacitated but wish to safeguard your future right to benefit, you should tell your employer about the accident/disease. You should apply for a declaration that your accident/disease was an occupational one
ga: Muna dtarlaíonn eágumas duit láithreach ach gur mian leat cinntiú go mbeadh an ceart agat amach anseo sochar a fháil, ba cheart duit d'fhostóir a chur ar an eolas maidir leis an timpiste/ galar agus dearbhú a iarradh ag rá gur tinneas/ timpiste cheirde a bhí i gceist

source: This should be done without delay
ga: Ba cheart é seo a dhéanamh gan mhoill

source: To apply, fill in a Medical Care form C1 (pdf)
ga: Seolfar foirm éilimh C1 chugat anseo (pdf)

source: You can get more information on the scheme in the leaflet Medical Care SW34
ga: Tá tuilleadh faisnéise ar fáil maidir an scéim í Medical Care SW34

source: Make sure you quote your PPS number on any receipts you send in with the medical care claim form C1. Note that only original receipts are accepted, payment will not issue for a claim based on photocopied receipts
ga: Déan cinnte de go gcuireann tú d'uimhir PSP (mar an gcéanna le d'uimhir cánach ) ar aon admhálacha a sheolann tú isteach in éineacht leis an bhfoirm éilimh C1
